"""
Задание 1
Установите и настройте на своем локальном компьютере Git.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 2
Создайте папку с двумя подпапками. В каждой подпапке добавьте несколько файлов.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 3
Создайте репозиторий в главной папке.
(git init)
----------------------------------------------
(если будем добавлять в GitHub то изначально забить имя и емайл (гитхабовский)
то есть поэтапно будет так:
git config --global user.name "ev-g-hash"
git config --global user.email "pihtulovevgeny@gmail.com"
git init)
--------------------------------------------------------
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 4
Добавьте содержимое двух подпапок в индекс репозитория с помощью команды: git add.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 5
Создайте commit на основании подпапок, добавленных в индекс.
Используйте команду: git commit.
после выполнения коммита закрыть окно
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 6
Измените содержимое одного из файлов в подпапке и создайте commit с новым данными.
в репозитории запустить заново гит и сделать git commit.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 7
Создайте новую подпапку, наполните её данными. После этого создайте commit c содержимым
новой подпапки.
-----
сначала git add "название папки"
потом git commit
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 8
Внесите изменения в содержимое файла в новой подпапке,
сохраните изменения (не создавайте новый commit).
Отмените изменения в локальной копии файла с помощью
команды: git checkout.


Задание 9
Внесите изменения в содержимое файла в новой подпапке,
добавьте изменения в индекс (не создавайте но-
вый commit). Отмените изменения в индексе с помощью
команды: git reset.


Задание 10:
Внесите изменения в содержимое файла в новой подпапке,
добавьте изменения в индекс, создайте новый commit.
Отмените изменения в последнем commit путем создания
нового commit с помощью команды: git revert.

Задание 11
Удалите несколько последних commit. Используйте
команду: git reset с опцией --hard.
dddddddd

Задание 12
Внесите изменения в последний commit не создавая
нового. Используйте: git commit с ключом --amend.
"""
